import React, { useState } from "react";
import SectionTitle from "components/shared/sectionTitle/SectionTitle";
import ChevronUpIcon from "@heroicons/react/solid/ChevronUpIcon";
import ChevronDownIcon from "@heroicons/react/solid/ChevronDownIcon";

function Faq() {
  return (
    <section className="container mx-auto my-32">
      <SectionTitle>الأسئلة الشائعة</SectionTitle>
      <div className="flex flex-col">
        <Question title="ما هي منصة نفذلي؟">
          منصة نفذلي هي منصة عربية تساعدك في الوصول إلى أفضل المستقلين المحترفين
          للتعاقد معهم للقيام بأعمالك ومشاريعك عبر الانترنت ، كذا تمكن المبدعين
          من إيجاد مكان للعمل وتحقيق دخل.
        </Question>
        <Question title="كيف يمكنني الاستفادة من نفذلي؟">
          في منصة نفذلي تستطيع نشر مشروعك كإنشاء موقع ويب أو تطبيق جوال أو حتى
          تصميم شعار وغيرها الكثير من التخصصات التي تحتاجها ، فتبدأ في تلقي عروض
          من المستقلين المحترفين المهتمين بالعمل على مشروعك لتقارن بين العروض
          وتختار أفضلها، ثم تقوم بتوظيف المستقل صاحب أفضل عرض وتتولى المتابعة
          معه حتى إتمام تنفيذ مشروعك، كما يمكنك البحث بنفسك عن أفضل المستقلين
          وتعرض عليهم مشروعك بشكل مباشر للعمل عليه ، توفر لك بيئة العمل للتعامل
          بشكل آمن وسريع مع كافة المستقلين.
        </Question>
        <Question title="كيف تضمن منصة نفذلي حقوقي؟">
          منصة نفذلي تضمن لك حقك المالي بشكل كامل فلا داع ﻷي قلق، كن مطمئنا عند
          إنشاء أي مشاريع جديدة أو شراء خدمات كذلك تقديم عروض على المشاريع
          المعروضة في الموقع أو بيع خدمات ، حيث تقوم منصة نفذلي بدور الوسيط بين
          صاحب المشروع أو مشتري الخدمة وبين المستقل أو بائع الخدمة وتحمي حقوق
          الطرفين المالية في حال الالتزام بشروط المنصة وبنود الضمان وتوضيح
          الاتفاق تماماً.
        </Question>
        <Question title="ما هي المجالات التي يمكنني توظيف مستقلين فيها على نفذلي؟">
          تلجأ الشركات إلى توظيف العاملين عن بُعد في مختلف التخصصات، منها على
          سبيل المثال لا الحصر العاملين في مجال البرمجة، وتحرير النصوص، والتسويق
          الإلكتروني، والتصميم والإعلانات، والترجمة،وادخال البيانات، وكتابة
          المقالات، وبعض أعمال العلاقات العامة عبر الإنترنت، وتصميم المواقع
          الإلكترونية وإدارة المواقع الإلكترونية، والدراسات والتحاليل السوقية
          وغيرها من التخصصات التي تحتاجها.
        </Question>
        <Question title="لماذا التوظيف عبر نفذلي هو الأفضل بالنسبة لي؟">
          مؤخراً انتشرت فكرة التوظيف عد بعد - خصوصاً بعد جائحة فيروس كورونا
          COVID-19 - حيث تلجأ الشركات والأفراد من انجاز مشاريعها عن بعد دون
          التقيد بأي حدود جغرافية ، لذلك فيمكنك الوصول إلى أفضل المستقلين
          المحترفين من جميع أنحاء العالم دون التقيد بزمان أو مكان محدد للعمل ،
          ومن هنا تزيد الانتاجية ، وكذلك ينخفض جزءً كبير من التكاليف وتوفر لك
          راحة نفسية وجسدية أثناء العمل.
        </Question>
        <Question title="ماذا سيحدث بعد نشر مشروعي على نفذلي؟">
          بعد نشر مشروعك، سيبقى معلقًا بانتظار المراجعة من قبل الدعم الفني الخاص
          بنفذلي. وبعدها إمّا تتم الموافقة عليه فيصلك إشعار بالموافقة ثم يظهر
          المشروع لجميع المستقلين للتقدم بعروضهم عليه، أو يتم رفضه مع ذكر
          الأسباب التي أدت لذلك لكي تقوم بتعديله وإرساله من جديد للمراجعة
          والقبول.
        </Question>
      </div>
    </section>
  );
}

function Question({ title, children }) {
  const [isOpened, setIsOpened] = useState(false);
  return (
    <div className="my-1 bg-gray-100 rounded-lg">
      <div
        className="flex flex-row justify-between cursor-pointer py-4 px-12"
        onClick={() => setIsOpened(!isOpened)}
      >
        <h4 className="text-xl select-none">{title}</h4>
        {isOpened ? (
          <ChevronUpIcon className="w-8 mx-4" />
        ) : (
          <ChevronDownIcon className="w-8 mx-4" />
        )}
      </div>

      <div
        className={`${
          isOpened ? "show" : "hidden"
        } mt-4 mb-10 mx-12 select-none transition-all duration-300 ease-in-out`}
      >
        {children}
      </div>
    </div>
  );
}

export default Faq;
